# BuiltInFailures.PathOfTravelFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PathOfTravelFailures Class
BuiltInFailures Class Members See Also
---
Failures about PathOfTravel.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class PathOfTravelFailures
```

Visual Basic
---
```text
Public NotInheritable Class PathOfTravelFailures
```

Visual C++
---
```text
public ref class PathOfTravelFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..PathOfTravelFailures
# See Also
BuiltInFailures..::..PathOfTravelFailures Members
Autodesk.Revit.DB Namespace